In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'col1' : [1,2,np.nan],
'col2' : [3,np.nan,np.nan],
'col3' : [4,5,6]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5
2   NaN   NaN     6

In [12]:
df.dropna() #drop null values

   col1  col2  col3
0   1.0   3.0     4

In [16]:
df.dropna(thresh = 2) #drop row having atleast two null values

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5

In [17]:
df.dropna(axis = 1)

   col3
0     4
1     5
2     6

In [18]:
df.fillna('FILL THIS')

        col1       col2  col3
0          1          3     4
1          2  FILL THIS     5
2  FILL THIS  FILL THIS     6

In [19]:
df['col1'].mean()

1.5

In [20]:
df['col1'].fillna(df['col3'].mean(), inplace = True)

In [21]:
df

   col1  col2  col3
0   1.0   3.0     4
1   2.0   NaN     5
2   5.0   NaN     6

In [22]:
df = pd.DataFrame({'names': 'john mike sarah'.split(),
                  'scores': [98,45,76],
                  "previous_scores": [43,67,90]})

In [23]:
df

   names  scores  previous_scores
0   john      98               43
1   mike      45               67
2  sarah      76               90

In [24]:
df[df['names']=='mike']

  names  scores  previous_scores
1  mike      45               67

In [25]:
df[df['names']=='mike'][['names','previous_scores']]

  names  previous_scores
1  mike               67

In [30]:
df[df['scores']>50]

   names  scores  previous_scores
0   john      98               43
2  sarah      76               90

In [33]:
df[(df['scores']>50) & (df['previous_scores']>70)]

   names  scores  previous_scores
2  sarah      76               90

In [35]:
def twice(num):
    return num*2

In [36]:
df['scores']=df['scores'].apply(twice)

In [37]:
df

   names  scores  previous_scores
0   john     196               43
1   mike      90               67
2  sarah     152               90

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
names              3 non-null object
scores             3 non-null int64
previous_scores    3 non-null int64
dtypes: int64(2), object(1)
memory usage: 152.0+ bytes